In [1]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np

In [14]:
path='D:\Artificial Intelligence\\1-Data Pre-processing\\3-Outliers (Detecting and Filtering)\\Example_Outliers.csv'
data=pd.read_csv(path)

In [15]:
data.head()

      name  highet
0  mohamed     2.9
1    ahmed     3.2
2      ali     3.6
3   khaled     4.6
4    hamza     2.4

In [43]:
#identify outliers
#1-domain knowlaede
max_value=data['highet'].quantile(0.85)
max_value

8.369999999999992

In [44]:
data[data['highet']>max_value]

      name  highet
5      amr    14.9
6  mostafa    13.2
7  ibrahim    15.3

In [45]:
min_value=data['highet'].quantile(0.05)
min_value

1.08

In [46]:
data[data['highet']<min_value]

     name  highet
10  essra     0.9

In [48]:
#removing outliers
new_data=data[(data['highet']<max_value)&(data['highet']>min_value)]

In [49]:
new_data

        name  highet
0    mohamed    2.90
1      ahmed    3.20
2        ali    3.60
3     khaled    4.60
4      hamza    2.40
8   abdullah    3.20
9      adham    1.10
11     hanan    2.00
12      dina    2.32
13     donia    2.30
14       aya    2.20
15      adel    6.30
16      omar    4.20
17      anas    3.70
18     omran    3.00